src/toir_cf/src/ExchangePlans/ОбменТОИР30УТ11/ОбменТОИР30УТ11.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="a3fb1db3-3e26-4abb-bb20-22a2783a6068">
  <name>ОбменТОИР30УТ11</name>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПоступлениеИВнутреннееПотребление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПоУсловию</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиДокументов</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/toir_cf/src/ExchangePlans/ОбменТОИР30УТ11/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		// Здесь описываются значения по умолчанию.
		ИспользоватьОтборПоОрганизациям = Ложь;
		ПереноситьАктивыВУпп = Истина;
		ОтражатьПринятиеКУчетуОСВУПП = Истина;
		ОтражатьСписаниеОСВУПП = Ложь;
		ОтражатьВыявленныеДефекты = Истина;
		ОтражатьЗаказыНаРемонт = Истина;
		ВыгружатьПоступлениеИВнутреннееПотребление = Истина;
		РемонтыПоППР = Истина;
		РемонтыПоДефектам = Истина;
		РемонтыПоВнешнимОснованиям = Истина;
		ИспользоватьОтборПоСкладам = Ложь;
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		РежимВыгрузкиПоУсловию = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ИспользоватьОтборПоОрганизациям Тогда
	    ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Организации.Организация"));
	КонецЕсли;
	
	Если Не ИспользоватьОтборПоСкладам Тогда
	    ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склады.Склад"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
